public/programming/notes/fisica/01-cinematica.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/simple.css" />
<meta property="og:title" content="Giovanni's Diary">
<meta property="og:description" content="Diary of Giovanni's adventures.">
<meta property="og:image" content="https://giovanni-diary.netlify.app/logo.png">
<meta property="og:url" content="https://giovanni-diary.netlify.app/">

</head>
<body>
<div id="content" class="content">
<p>
<a href="../../../index.html">Giovanni's Diary</a> &gt; <a href="../../../subjects.html">Subjects</a> &gt; <a href="../../programming.html">Programming</a> &gt; <a href="../notes.html">Notes</a> &gt; <a href="fisica.html">Fisica</a> &gt;
</p>

<div id="outline-container-org71ba747" class="outline-2">
<h2 id="org71ba747">Cinematica</h2>
<div class="outline-text-2" id="text-org71ba747">
<p>
La cinematica e' quella branca della meccanica che studia il moto dei
corpi ricorrendo esclusivamente alle nozioni di spazio e di tempo,
indipendentemente dalle cause (forze) del moto stesso di cui si occupa
invece la dinamica.
</p>
</div>

<div id="outline-container-org05e7dc2" class="outline-3">
<h3 id="org05e7dc2">Vettori</h3>
<div class="outline-text-3" id="text-org05e7dc2">
<p>
Un vettore e' caratterizzato da:
</p>

<ul class="org-ul">
<li>verso ("punta")</li>
<li>direzione (retta)</li>
<li>lunghezza (o modulo)</li>
</ul>

<p>
Operazioni tra vettori:
</p>

<ol class="org-ol">
<li><b><b>Somma</b></b>: \(\vec{c} = \vec{a} + \vec{b}\) e' uguale alla somma degli elementi individuali
<ul class="org-ul">
<li>graficamente questo so può rappresentare con il metodo del
parallelogramma o il metodo del punta-coda</li>
</ul></li>
<li><b><b>Prodotto</b></b>: \(\vec{w}=c\vec{v}\) e' uguale al prodotto di tutti gli
elementi di v
<ul class="org-ul">
<li>\(|v^2|=\sum_{i=0}^{N} v_i^2\)</li>
</ul></li>
<li><b><b>Sottrazione</b></b>: \(\vec{d}=\vec{a}-\vec{b} = \vec{a} + -1 * \vec{b}\)</li>
<li><b><b>Prodotto scalare</b></b>: \(s = \vec{a} * \vec{b}\) 
<ul class="org-ul">
<li>\(\vec{a} * \vec{b} = cos(\theta) * |\vec{a}| * |\vec{b}|\)</li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-orge1b5dd9" class="outline-3">
<h3 id="orge1b5dd9">Moto rettilineo uniforme</h3>
<div class="outline-text-3" id="text-orge1b5dd9">
<p>
La legge oraria del moto uniforme, ossia lo spazio in funzione del
tempo, e' la seguente:
</p>

<p>
\[ \vec{X}(t) = \vec{X_0} + \vec{v}(t-t_0) \]
</p>
</div>
</div>

<div id="outline-container-org18b1f32" class="outline-3">
<h3 id="org18b1f32">Moto rettilineo uniformemente accelerato</h3>
<div class="outline-text-3" id="text-org18b1f32">
<p>
Nel moto rettilineo uniformemente accelerato, l'accelerazione non e'
nulla. La funzione della velocità e dello spazio sono le seguenti:
</p>

<p>
\[ (1)\ \vec v(t) = \vec{v_i} + a\Delta t\]
\[ (2)\ \vec{X}(t) = \vec{X_i} + \vec{v_i}\Delta t + \frac{1}{2}a\Delta t^2 \]
</p>
</div>

<div id="outline-container-org3dfdc6c" class="outline-4">
<h4 id="org3dfdc6c">Equazione della velocita'</h4>
<div class="outline-text-4" id="text-org3dfdc6c">
<p>
Sappiamo che, per definizione:
\[ \vec{a} = \lim_{\Delta t \to 0} \frac{\Delta \vec{v}}{\Delta t} = \frac{d\vec{v}}{dt}\]
\[ \vec{a}\ dt = d\vec{v} \]
</p>

<p>
Integriamo ora a destra e a sinistra:
</p>

<p>
\[ \int a\ dt = \int d\vec{v} \]
</p>

<p>
Per la proprietà fondamentale degli integrali, l'integrale di \(dt\) è proprio \(\Delta t\). Lo stesso discorso vale per delta v:
</p>

<p>
\[ \vec{a} \Delta t = \Delta \vec{v} \]
</p>

<p>
Dunque 
</p>

<p>
\[ \vec{v_f} = \vec{v_i} + a\Delta t \]
</p>
</div>
</div>

<div id="outline-container-org0115a7d" class="outline-4">
<h4 id="org0115a7d">Equazione dello spazio</h4>
<div class="outline-text-4" id="text-org0115a7d">
<p>
Per  il moto rettilineo uniforme, vale:
</p>

<p>
\[ \vec{X}(t) = \vec{X_0} + \vec{v}\Delta t\]
\[ \vec{X}(t) = \vec{X_0} + \vec{v} \int_{0}^{t_f} dt \]
\[ \vec{X}(t) = \vec{X_0} + \int_{0}^{t_f}\vec{v}dt \]
</p>

<p>
Sostituisco \(v\) con quanto risultato precedentemente:
</p>

<p>
\[ \vec{X}(t) = \vec{X_0} + \int_{0}^{t_f} (\vec{v_i} +a \Delta t) dt \]
\[ \vec{X}(t) = \vec{X_0} + \int_{0}^{t_f}\vec{v_i} dt + \int_{0}^{t_f} a\Delta t dt \]
\[ \vec{X}(t) = \vec{X_0} + \vec{v_i}\Delta t + \frac{1}{2}a\Delta t^2 \]
</p>
</div>
</div>
</div>

<div id="outline-container-orgfed0c67" class="outline-3">
<h3 id="orgfed0c67">Moto Parabolico</h3>
<div class="outline-text-3" id="text-orgfed0c67">
<p>
Osserviamo che il moto parabolico può essere visto come l'unione di
due moti rettilinei:
</p>

<ul class="org-ul">
<li>sull'asse \(x\), un moto rettilineo uniforme</li>
<li>sull'asse \(y\), un moto rettilineo uniformemente accelerato</li>
</ul>

<p>
\[x=v_{0x}t\]
\[y=v_{oy}t -\frac{1}{2}gt^2\]
Allora:
\[y = -\frac{g}{2v_{ox}^2}x^2 + \frac{v_{0y}}{v_0x}x+0\]
Infatti l'equazione rappresenta proprio il moto di una parabola.
\[y = ax^2 + bx + c\]
</p>

<ul class="org-ul">
<li>\(a\) e' sempre minore di 0</li>
<li>\(b = tan(\alpha)\)</li>
<li>\(x_{max}\) si ottiene ponendo la derivata dello spazio a 0</li>
<li>la gittata si ottiene ponendo \(y\) a 0</li>
</ul>
</div>
</div>

<div id="outline-container-org91a5dc0" class="outline-3">
<h3 id="org91a5dc0">Moto armonico</h3>
<div class="outline-text-3" id="text-org91a5dc0">
<p>
La funzione oraria del moto armonico e' sa seguente:
\[ X(t) = A sin(\omega t + \phi) \]
Dove chiamiamo:
</p>

<ul class="org-ul">
<li>\(A\): ampiezza di oscillazione</li>
<li>\(w\): pulsazione</li>
<li>\(\phi\): fase</li>
</ul>

<p>
La \(\phi\) rappresenta la traslazione dallo 0 sull'asse del
tempo. Osservando l'analisi dimensionale, vale che \(A\) e' una
lunghezza e \(wt\) e' una quantità non dimensionale. Di conseguenza
omega delve essere \(|\frac{1}{t}|\) scritto anche \(T^{-1}\). Nella
prossima sezione mostreremo che vale \(\omega T = 2 \pi\) dunque omega
si può misurare anche in \(\frac{rad}{s}\).
</p>
</div>

<div id="outline-container-org121929b" class="outline-4">
<h4 id="org121929b">Periodo del moto armonico</h4>
<div class="outline-text-4" id="text-org121929b">
<p>
Una funzione f(x) si dice periodica con periodo T se
\[ f(x+T) = f(x)\ \forall x \in D_f \]
</p>

<p>
Per quale T vale:
\[ sin(\omega t + \phi) =?\ sin(\omega (T+t) +\phi)\]
Assumiamo la fase nulla. Deve valere che
\[ sin(\omega (T+t)) = sin(\omega t + 2 \pi) \]
Questo si verifica se
\[ \omega (T+t) = \omega t +2\pi \]
\[ \omega T = 2 \pi \]
\[ T = \frac{2 \pi}{\omega} \]
</p>
</div>
</div>

<div id="outline-container-orgdb3969c" class="outline-4">
<h4 id="orgdb3969c">Velocità e accelerazione del moto armonico</h4>
<div class="outline-text-4" id="text-orgdb3969c">
<p>
Possiamo derivare lo spazio per ottenere l'equazione della velocità:
\[ v(t) = \omega A cos(\omega T + \phi) \]
E deriviamo ulteriormente per ottenere l'accelerazione:
\[ -w^2 A cos(\omega T + \phi) \]
</p>

<p>
Possiamo fare delle altre osservazioni, per esempio che il punto di
velocità massima e' quando l'equazione dello spazio tocca lo zero,
questo perché quando il seno e' 0, il suo coseno e' 1. L'accelerazione
e' specchiata rispetto all'asse x allo spazio.
</p>
</div>
</div>

<div id="outline-container-orgf3bdd30" class="outline-4">
<h4 id="orgf3bdd30">Equazione differenziale del moto armonico</h4>
<div class="outline-text-4" id="text-orgf3bdd30">
<p>
Osserviamo che l'equazione del moto armonico vista in precedenza e' la
soluzione dell'equazione differenziale:
</p>

<p>
\[ \theta'' + \omega^2\theta = 0 \]
</p>

<p>
Questa osservazione ci e' molto utile per trovare \(w\) sia nel moto del
pendolo che nel moto della molla.
</p>
</div>
</div>
</div>

<div id="outline-container-org09f08f3" class="outline-3">
<h3 id="org09f08f3">Moto circolare</h3>
<div class="outline-text-3" id="text-org09f08f3">
<p>
Un caso di moto armonico e' il moto circolare, dove entrambe le
direzioni \(x\) ed \(y\) seguono il moto armonico.
</p>
</div>

<div id="outline-container-orgb1991ca" class="outline-4">
<h4 id="orgb1991ca">Coordinate polari</h4>
<div class="outline-text-4" id="text-orgb1991ca">
<p>
In un <b><b>moto circolare</b></b>, e' utile identificare un punto nello spazio
in funzione del raggio \(\rho\) e dell'angolo \(\phi\)
</p>

<p>
\[(x, y) \rightarrow (\rho, \phi)\]
</p>

<p>
Vale:
</p>

<p>
\[(\rho, \phi) = (\sqrt{x^2 + y^2},\ atan(\frac{x}{y}))\]
\[(x, y) = (\rho\ cos(\phi), \rho \ sin(\phi))\]
</p>

<p>
per casa: calcolare velocità e accelerazione.
</p>
</div>
</div>

<div id="outline-container-org012685a" class="outline-4">
<h4 id="org012685a">Accelerazione nel moto circolare</h4>
<div class="outline-text-4" id="text-org012685a">
<p>
La velocità, per definizione, e' sempre <b><b>tangente alla traiettoria</b></b>,
infatti descrive la direzione dello spostamento nel prossimo istante.
</p>

<p>
\[\frac{v_x}{v_y} = \frac{\frac{dx}{dt}}{\frac{dy}{dy}}=\frac{dx}{dy} = y'(x)\]
</p>

<p>
Sia \(\hat{u}_t\) il versore della tangente, posso scrivere:
</p>

<p>
\[\vec{v} = |\vec{v}| \hat{u}_t\]
</p>

<p>
Allo stesso modo l'accelerazione:
</p>

<p>
\[\vec{a} = \frac{d\vec{v}}{dt} = \frac{d}{dt}(|\vec{v}|\hat{u}_t)=\frac{d|\vec{v}|}{dt}\hat{u}_t + |\vec{v}|\frac{d\vec{u}_t}{dt}\]
</p>

<p>
Vale:
</p>

<p>
\[\frac{d\hat{u}_t}{dt} = \frac{ \hat{u}_t' - \hat{u}_t}{dt}=\frac{d\phi}{dt}\hat{u}_{normale}\]
</p>

<p>
infatti, la differenza infinitesima tra le tangenti di due velocità
vicine nel tempo, sara' il vettore perpendicolare alla velocità (per
la regola dei parallelogrammi) anche detto vettore <b><b>normale</b></b>. E'
molto semplice una dimostrazione grafica: osserviamo che lo spazio
tra due \(\phi\) molto vicini nel tempo può essere <b><b>approssimato</b></b> ad
un arco di circonferenza di raggio \(r\) (anche se il percorso più in
grande e' un circuito di formula 1), <b><b>usando un sistema di
riferimento che meglio approssima la circonferenza</b></b>.
</p>

<p>
Vale anche:
</p>

<p>
\[\frac{d\phi}{dt} = \frac{d\phi}{dS} \frac{dS}{dt} = \frac{v}{r}\]
</p>

<p>
Avendo usato la formula per calcolare l'arco di circonferenza (che
viene approssimato qua):
</p>

<p>
\[r\ d\phi=dS \rightarrow \frac{d\phi}{dS}=d\phi\]
</p>

<p>
Quindi riportando questo all'equazione dell'accelerazione:
</p>

<p>
\[\vec{a}=\frac{dv}{dt}\hat{u}_t + \frac{v^2}{r}\hat{u}_{normale}\]
</p>

<p>
Dunque abbiamo 3 vettori:
</p>

<ul class="org-ul">
<li><b><b>accelerazione tangenziale</b></b> \(\hat{v}_t\)</li>
<li><b><b>accelerazione normale</b></b> con verso \(\hat{u}_{normale}\)</li>
<li>il raggio di curvatura \(r\)</li>
</ul>
</div>
</div>


<div id="outline-container-org01793c9" class="outline-4">
<h4 id="org01793c9">Moto Circolare Uniforme</h4>
<div class="outline-text-4" id="text-org01793c9">
<p>
Con velocita' costante, l'accelerazione normale dalla formula
precedente diventa:
</p>

<p>
\[\hat{a}=\frac{v^2}{R}\hat{u}_n\]
</p>

<p>
Con accelerazione normale e velocita' costante, anche il raggio e'
costante. Chiamiamo l'accelerazione normale come <b><b>accelerazione
centripeda</b></b>.  Definiamo la <b><b>velocita' angolare</b></b> come:
</p>

<p>
\[\omega =^{def} \frac{d\phi}{dt} =^{arco\ di\ circ.} \frac{v}{R}\]
</p>

<p>
Sia P un punto nella circonferenza di raggio R.  Ricordando che il
moto circolare e' la composizione di due moti armonici, vale:
</p>

<p>
\[ X_p = Rcos(\alpha) \]
\[ Y_p = Rsin(\alpha) \]
</p>

<p>
Inoltre, dato che:
</p>

<p>
\[ \alpha = \omega t \]
</p>

<p>
Vale:
\[ X_p = Rcos(\omega t) \]
\[ Y_p = Rsin(\omega p) \]
</p>

<p>
Deriviamo ora lo spazio, trovando la velocità:
</p>

<p>
\[ v_{xp} = -\omega Rsin(\omega t) \]
</p>

<p>
\[ v_{yp} = \omega Rcos(\omega t) \]
Derivando ancora troviamo l'accelerazione:
</p>

<p>
\[ a_{xp} = -\omega ^2 Rcos(\omega t) \]
\[ a_{yp} = -\omega ^2Rsin(\omega t) \]
</p>

<p>
Osserviamo che possiamo sostituire \(R\ cos(wt)\) con \(X\), allo stesso
modo \(Y\):
</p>

<p>
\[ a_{xp} = -\omega ^2X_p \]
\[ a_{yp} = -\omega ^2Y_p \]
Sommando ora le componenti:
</p>

<p>
\[ |\vec{a_p}| = \sqrt{a_{xp}^2 + a_{yp}^2} \]
\[ |\vec{a_p}| = \sqrt{\omega ^4 X_p^2 + \omega ^4 Y_p^2} \]
\[ \vec{a_p} = \omega ^2 \sqrt{X_p^2 + Y_p^2}\]
</p>

<p>
Concludiamo che:
</p>

<p>
\[ a = \omega ^ 2R \]
</p>
</div>
</div>
</div>

<div id="outline-container-org075af87" class="outline-3">
<h3 id="org075af87">Definizioni importanti</h3>
<div class="outline-text-3" id="text-org075af87">
<p>
Definiamo:
</p>

<ul class="org-ul">
<li>velocità tangenziale: \(v = \frac{C}{T} = \frac{2\pi R}{T}\)</li>
<li>velocità angolare istantanea: \(\omega = \frac{2\pi}{T}\ (\frac{rad}{s})\)</li>
<li>\(a_c = \frac{\Delta \vec{v}}{\Delta t}\)</li>
</ul>

<p>
Ne deriviamo che:
</p>

<ul class="org-ul">
<li>\(v = \omega R\)</li>
<li>\(a_{centripeta} = \omega ^ 2R = \frac{v^2}{R}\)</li>
<li>\(\vec{F}_c = m\vec{a}_c\)</li>
<li>L'accelerazione centripeta è sempre rivolta verso il centro.</li>
</ul>


<hr />

<p>
Travel: <a href="fisica.html">Fisica</a>, <a href="../../../theindex.html">Index</a>
</p>
</div>
</div>
</div>
</div>
</body>
</html>
